0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    backplane
    {
        type    symmetryPlane;
    }
    frontplane
    {
        type    symmetryPlane;
    }
    inlet          
    {
        type        zeroGradient;
    }
    outlet           
    {
        type            fixedValue;
        value       uniform 0;
    }
    Flipper_Flipper
    {
        type            zeroGradient;
    }

    farfield
    {
        type    zeroGradient;
    }
}

// ************************************************************************* //
