0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;   // mass flow rate
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];  // mass flow rate

internalField   uniform 0;

boundaryField
{
    backplane
    {
        type    symmetryPlane;
    }
    frontplane
    {
        type    symmetryPlane;
    }
    inlet          
    {
        type        zeroGradient;
    }
    outlet           
    {
        type            fixedValue;
        value       uniform 0;
    }
    Flipper_Flipper
    {
        type            calculated;
        value           uniform 0;
    }
    farfield
    {
        type            calculated;
        value           uniform 0;
    }
}
